import 'package:hawdaj/core/utils/assets.dart';

class Destination {
  String id;
  String name;
  String description;
  num rating;
  String location;
  bool isOpen;
  String image;

  Destination({
    required this.id,
    required this.name,
    required this.description,
    required this.image,
    required this.location,
    required this.rating,
    required this.isOpen,
  });

  static List<Destination> destinationsList = [
    Destination(
      id: '2',
      name: 'مركز الملك عبدالله المالي',
      description:
      'يعتبر مركز الملك عبدالله المالي واجهة الرياض الاقتصادية والترفيهية ومعلم جديد ومهم في قلب العاصمة، حيث صُمّم في الأساس ليكون مركزاً مالياً رائداً على مستوى منطقة الشرق الأوسط، إلى جانب دوره الترفيهي الفعال، حيث يتكون الجزء المخصص فيه للترفيه من 13 مبنى فيها من المتاحف، الأسواق والحدائق.',
      image: Assets.king_abdullah_financial,
      location: 'الرياض',
      rating: 4.8,
      isOpen: true,
    ),
    Destination(
      id: '5',
      name: 'وقف أبراج البيت',
      description:
      'استمتع بزيارة أفضل مراكز التسوق في مكة المكرمة وأفخم الفنادق من فئة 5 نجوم وإحدى أطولها في العالم بارتفاع يصل إلى 600 متراً. يقع المجمّع على مساحة تتجاوز 1.4 مليون متر مربع وبه كل ماتحتاجه من محلات تجارية لماركات عالمية ومحلات هدايا وكذلك العديد من المطاعم.',
      image: Assets.abraj_al_bait,
      location: 'مكه',
      rating: 4.8,
      isOpen: true,
    ),
    Destination(
      id: '1',
      name: 'حافة العالم ( جبل فهرين )',
      description:
          'تعد حافة جبل فهرين "حافة العالم" أو كما يسميها السعوديون "المطلّ" واحدة من أروع المناظر الطبيعية الخلابة في المملكة، إلى جانب كونها معلم طبيعي يخطف الأنفاس، يقال أن تلك المنطقة كانت ميداناً لشعراء كبار أمثال زهير بن أبي سلمى، والأعشى، وجرير وغيرهم. استكشف الطبيعة الساحرة واستشعر هيبة حافة جبل فهرين التي تبدو للناظر وكأنها تمتد إلى ما لا نهاية.',
      image: Assets.edge_of_the_world,
      location: 'الرياض',
      rating: 4.8,
      isOpen: true,
    ),
    Destination(
      id: '3',
      name: 'جزيرة المرجان',
      description:
          'واحدة من أروع معالم السياحة في الدمام وتعتبر من أهم المقاصد التي تستقطب عدداً كبيراً من الزوّار الباحثين عن الاستجمام بين أحضان الطبيعة الخلابة. يمكنك زيارة المنتزه سيرًا على الأقدام للاستمتاع بجمال الممشى، والهواء النقي، والساحات الخضراء التي تملأ المكان وتتخللها أشجار النخيل المنتشرة في جميع أنحاء الجزيرة وملاعب الأطفال التي تكسوها الفرحة والبهجة.',
      image: Assets.marjan_island,
      location: 'الدمام',
      rating: 4.8,
      isOpen: true,
    ),
    Destination(
      id: '6',
      name: 'جبل أبي قبيس',
      description:
      'يقع هذا الجبل في الجهة الشرقية للمسجد الحرام ويبلغ ارتفاعه 420 متراً تقريباً ويقال بأنه سُمي بأبي قبيس لأن الحجر الأسود أقتُبس منه، ويمتاز الجبل عن بقية الجبال بوجود الحجر الأسود فيه منذ قدم الزمان، وبكونه يُشرف على الكعبة، بل إنّ الربوة التي بنيت عليها الكعبة تتصل بأصل جبل أبي قبيس.',
      image: Assets.the_mount_of_abu_qubays,
      location: 'مكه',
      rating: 4.8,
      isOpen: true,
    ),

    Destination(
      id: '4',
      name: 'شاطئ نصف القمر',
      description:
          'يعتبر أبرز وأجمل الشواطئ في الدمام ويشتهر بمياهه النقية ورماله البيضاء. وتعود تسميته بسبب شكله المنحني الذي يشبه نصف القمر. ويبلغ متوسط عمقه حوالي 22 قدمًا مما يجعله وجهة مناسبة لضمان تجربة ممتعة مع العائلة وخاصة لمحبي رياضة الغوص؛ حيث يمكن للغواصين الاستمتاع بأسرار الحياة البحرية وسط الشعاب المرجانية المنتشرة في عمقه.',
      image: Assets.half_moon_bay,
      location: 'الدمام',
      rating: 4.8,
      isOpen: true,
    ),
    Destination(
      id: '7',
      name: 'قرية الحبلة',
      description:
          'سُميت القرية بهذا الاسم لأن السكان كانوا يستخدمون الحبال كوسيلة للتنقل ونقل البضائع لصعوبة التضاريس فيها، وتتميز بقطوع في الجبال بارتفاع يزيد عن 2000م، لا تفوّت مشاهدة وعورة الجبال والرمال من الأعلى بالتلفريك.',
      image: Assets.the_habala_hanging_village,
      location: 'ابها',
      rating: 4.8,
      isOpen: true,
    ),
    Destination(
      id: '8',
      name: 'منتزه عسير الوطني',
      description:
          'تعد مأوى لأكثر من 300 نوع من الطيور والحيوانات وهي أول حديقة في المملكة، تمتد على مساحة 1600 كيلو متر مربع وتحتوي على 62 موقعًا للتخييم، وهي مناسبة لرياضة المشي لمسافات طويلة، وتعتبر موطناً لجبل السودة وهو أعلى جبل في المملكة بارتفاع حوالي 10848 قدم عن سطح البحر.',
      image: Assets.asir_national_park,
      location: 'ابها',
      rating: 4.8,
      isOpen: true,
    ),
  ];
}
